# Data Types
# დავალება 1
# მიზანი: მიანიჭეთ რიცხვის ტიპი type() ფუნქციით ans1 ცვლადს
number = 12
ans1 = type(number)
print(ans1)


# დავალება 2
# მიზანი: type casting-ის მეშვეობით გადაიყვანეთ price ცვლადი float-ად
price = "9.99"
ans2 = float(price)
print(ans2)


# დავალება 3
# მიზანი: დააბეჭდინეთ კოდს დღევანდელი აქციის წინადადება.
price1 = 9.99
ans3 = f"იყიდეთ ფეხსაცმელი მხოლოდ {price1} ლარად."
print(ans3)


# დავალება 4
# მიზანი: დააბეჭდინეთ მათემატიკური გამოსახულება (ჯამი უნდა იყოს int-ი)
a = 9.99
b = "0.01"
ans4 = f"{a} + {b} = {int(a + float(b))}"
print(ans4)


# დავალება 5
# მიზანი: დააბეჭდინეთ კოდს დღევანდელი აქციის წინადადება (ჯამი უნდა იყოს int-ი)
# არ გამოიყენოთ string formating-ი 
a = 9.99
b = "0.01"
ans5 = str(a) + " + " + (b) + " = " + str( int(a + float(b) ))
print(ans5)


# Slicing
lst = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27,
28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54,
55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81,
82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100]


# დავალება 1
# Slicing-ის მეშვეობით დაბეჭდეთ პირველი 5 რიცხვი. 
# პასუხი უნდა გამოყურებოდეს ასე: [0, 1, 2, 3, 4]
print(lst[:5])


# დავალება 2
# Slicing-ის მეშვეობით დაბეჭდეთ ბოლო 5 რიცხვი (Reverse Indexing -ის მეშვეობით). 
# პასუხი უნდა გამოყურებოდეს ასე: [96, 97, 98, 99, 100]
print(lst[-5:])


# დავალება 3
# Slicing-ის მეშვეობით დაბეჭდეთ მხოლოდ ლუწი რიცხვები. 
# პასუხი უნდა იწყებოდეს ასე: [2, 4, 6, 8, 10, 12, 14, ...]
print(lst[2::2])


# დავალება 4
# Slicing-ის მეშვეობით დაბეჭდეთ რიცხვები რომლებიც იყოფა 5-ზე. 
# პასუხი უნდა იწყებოდეს ასე: [5, 10, 15, 20, 25, 30, 35, ...]
print(lst[5::5])


# დავალება 5
# Slicing-ის მეშვეობით დაბეჭდეთ რიცხვები 90-დან ყველა რიცხვი, გარდა ბოლო 5 რიცხვისა. 
# პასუხი უნდა გამოყურებოდეს ასე: [90, 91, 92, 93, 94, 95]
print(lst[90:96])


# დავალება 6
# Slicing-ის მეშვეობით დაბეჭდეთ რიცხვები უკუღმა. 
# პასუხი უნდა იწყებოდეს ასე: [100, 99, 98, 97, 96, 95, ...]
print(lst[::-1])


# დავალება 7
# Slicing-ის მეშვეობით დაბეჭდეთ რიცხვები უკუღმა 20-დან 40-ის ჩათვლით. 
# პასუხი უნდა იწყებოდეს ასე: [40, 39, 38, 37, 36, 35, ...]
print(lst[40:19:-1])
